{
    "candidates": {
        "Anura Kumara Dissanayake": {
            "party": "NPP",
            "manifesto": {
                "healthcare": {
                    "policy": "Gradually increase government expenditure on health to at least 3% of GDP.",
                    "actions": [
                        "Expand care facilities for the elderly and chronically ill.",
                        "Ensure early diagnosis through annual medical tests for citizens over 40."
                    ]
                },
                "economy": {
                    "policy": "Transform Sri Lanka into a globally connected social market economy.",
                    "actions": [
                        "Eradicate corruption and strengthen transparency in governance.",
                        "Promote a green economy with sustainable energy policies."
                    ]
                },
                "education": {
                    "policy": "Expand educational opportunities by modernizing syllabi and teaching methods.",
                    "actions": [
                        "Introduce vocational training boards across all provinces.",
                        "Ensure technological education is prioritized at all levels."
                    ]
                },
                "social_security": {
                    "policy": "Strengthen social security and protection networks for vulnerable communities.",
                    "actions": [
                        "Provide concessional loans for farmers and female-headed households.",
                        "Establish a social security fund for all workers."
                    ]
                }
            }
        },
        "Sajith Premadasa": {
            "party": "Samagi Jana Balawegaya",
            "manifesto": {
                "healthcare": {
                    "policy": "Reinforce the healthcare sector with professional and technological resources.",
                    "actions": [
                        "Introduce a resilient healthcare insurance scheme for all citizens.",
                        "Upgrade conditions in government hospitals across the country."
                    ]
                },
                "economy": {
                    "policy": "Build a resilient economy through transparency and accountability.",
                    "actions": [
                        "Manage the debt crisis by adhering to IMF guidelines while protecting vulnerable populations.",
                        "Increase government revenue through digitization and efficient tax policies."
                    ]
                },
                "education": {
                    "policy": "Create internationally competitive human capital through educational reform.",
                    "actions": [
                        "Revamp the education sector to include vocational training and digital learning platforms.",
                        "Increase Mahapola scholarships and other bursaries."
                    ]
                },
                "social_security": {
                    "policy": "Empower every citizen with access to essential social services.",
                    "actions": [
                        "Ensure equitable distribution of Samurdhi financial benefits.",
                        "Establish a national salary structure to minimize wage disparities."
                    ]
                }
            }
        },
        "Ranil Wickremesinghe": {
            "party": "UNP",
            "manifesto": {
                "healthcare": {
                    "policy": "Introduce regulations for private hospitals and enhance public healthcare.",
                    "actions": [
                        "Establish a Pharmaceutical Standardization Institute.",
                        "Expand palliative care services for the elderly and terminally ill."
                    ]
                },
                "economy": {
                    "policy": "Implement strong fiscal discipline and reforms to stimulate economic growth.",
                    "actions": [
                        "Encourage foreign investments in renewable energy.",
                        "Modernize industries with a focus on innovation and technology."
                    ]
                },
                "education": {
                    "policy": "Transform the education system by incorporating life skills and technology.",
                    "actions": [
                        "Revise school education to prioritize soft skills, life skills, and English proficiency.",
                        "Create Vocational Skills Sri Lanka (VSSL) to oversee vocational training."
                    ]
                },
                "social_security": {
                    "policy": "Provide robust social protection and worker rights.",
                    "actions": [
                        "Grant concessional loans for middle-class families to construct houses.",
                        "Strengthen cooperative banks and ensure fair treatment of workers."
                    ]
                }
            }
        },
        "Namal Rajapaksa": {
            "party": "SLPP",
            "manifesto": {
                "healthcare": {
                    "policy": "Improve life expectancy and strengthen healthcare infrastructure.",
                    "actions": [
                        "Develop public healthcare facilities and provide high-quality services.",
                        "Create a special medical insurance scheme for elderly monks."
                    ]
                },
                "economy": {
                    "policy": "Promote Sri Lanka as a regional center for renewable energy.",
                    "actions": [
                        "Optimize natural resources like sunlight, wind, and water for energy.",
                        "Encourage investments in green technology and industrial innovation."
                    ]
                },
                "education": {
                    "policy": "Strengthen education with a focus on technology and vocational training.",
                    "actions": [
                        "Introduce digital learning platforms and expand the ‘Sakwala’ program.",
                        "Provide vocational training opportunities through provincial boards."
                    ]
                },
                "social_security": {
                    "policy": "Ensure financial assistance for low-income families and the elderly.",
                    "actions": [
                        "Provide Rs. 5,000 monthly to senior citizens needing assistance.",
                        "Offer concessional loans to women-led households and entrepreneurs."
                    ]
                }
            }
        }
    }
}